In [25]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

import matplotlib as mpl
plt.rcParams["font.family"] = 'NanumGothic'

In [26]:
age_data = pd.read_csv('./data/population_by_age.csv')
trend_data = pd.read_csv('./data/population_trend.csv')
region_data = pd.read_csv('./data/population_by_region.csv', encoding='CP949')
area_data = pd.read_csv('./data/region_area.csv',encoding='CP949')

## 0. 각 데이터를 확인해 보세요.

```
df.head(10) # df 상위 10개 데이터 선택
```

In [57]:
age_data.head(10)

   age   man  woman
0    0  2564   2375
1    1  2983   2762
2    2  3216   2928
3    3  3185   3102
4    4  3215   3143
5    5  3657   3516
6    6  3613   3358
7    7  3600   3360
8    8  3492   3217
9    9  3493   3331

In [60]:
trend_data.head(5)

   year  korean_man  korean_woman  foreign_man  foreign_woman
0  1995      256182        262654          310            248
1  1996      258411        264611          395            319
2  1997      260587        266655          430            344
3  1998      264391        269288          378            329
4  1999      266974        271406          385            364

In [ ]:
# Your Code

### 1.age 데이터를 활용하여 10대 남자 중 인구수가 많은 순서대로 데이터를 구하세요.

In [49]:
# Your Code

     man
17  4580
18  4337
19  4337
16  4105
10  3786
15  3764
14  3755
13  3598
11  3568
12  3433

### 2. age 데이터를 활용하여 20대 여자 중 인구수가 적은 순서기준으로 상위 5개 데이터를 구하세요.

In [97]:
# Your Code

### 3. region과 area 데이터를 활용하여 region 대비 총 인구수(총 인구수 / 지역 면적(area) )를 구하고 region 대비 총 인구수 값이 높은 상위 5개 지역과 인구밀도를 표현하는 차트를 그리세요.

In [98]:
# Your Code

### 4. region 데이터를 활용하여 City 별 남, 녀 인구합산 데이터를 구하고 인구수가 많은 region 10개 데이터를 표현하는 차트를 그리세요.

In [99]:
# Your Code

### 5. trend 데이터를 활용하여 한국인 남성, 한국인 여성 인구 추이를 표현하는 차트를 그리세요.
* x 축에는 year, y 축에는 population 으로 축 제목을 표시하세요.
* 성별을 구분할 수 있도록 색깔을 표시하고 legend(범례)를 추가하세요.

In [100]:
# Your Code

### 6. region과 area 데이터를 활용하여 총 인구수 와 지역 면적을 표현할 수 있는 차트를 그리세요.

In [101]:
# Your Code

### 7. region 데이터를 활용하여 City의 비율을 표시할 수 있는 pie chart를 그리세요.

In [102]:
# Your Code